<?php
/********************************************************/
/* プログラム名：bootstrap.php                          */
/*======================================================*/
/* 概要：クラスローダーの読み込み、インスタンス化       */
/*======================================================*/
/* 作成日：2016-9-5                                     */
/* 作成者：鶴田 博文                                    */
/* 最終更新日：                                         */
/* 更新者：                                             */
/********************************************************/

require 'core/ClassLoader.php';

$clsLoader = new ClassLoader();
$clsLoader->registerDir(dirname(__FILE__) . '/core');
$clsLoader->registerDir(dirname(__FILE__) . '/models');
$clsLoader->register();
