<!--*****************************************************/
/* プログラム名：record_number.php                      */
/*======================================================*/
/* 概要：『○件中○〜○件を表示』を表示                 */
/*======================================================*/
/* 作成日：2016-9-5                                     */
/* 作成者：鶴田 博文                                    */
/* 最終更新日：                                         */
/* 更新者：                                             */
/******************************************************-->

<p>
    <?php echo $this->escape($recordNumber); ?>
    件中
    <?php echo $this->escape($offset + 1); ?>
    〜
    <?php if ($recordNumber > $page * 10): ?>
        <?php echo $this->escape($page * 10); ?>
    <?php elseif ($recordNumber < $page * 10): ?>
        <?php echo $this->escape($recordNumber); ?>
    <?php endif; ?>
    件を表示
</p>
