<?php
/********************************************************/
/* プログラム名：ClassLoader.php                        */
/*======================================================*/
/* 概要：オートロードの設定を行う                       */
/*======================================================*/
/* 作成日：2016-9-5                                     */
/* 作成者：鶴田 博文                                    */
/* 最終更新日：                                         */
/* 更新者：                                             */
/********************************************************/

class ClassLoader
{
    protected $_directories = array(); //オートロードの対象のディレクトリを格納

    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: registerDir                                  */
    /*======================================================*/
    /* 概要  : オートロードの対象のパスを$_directoriesに格納*/
    /* 引数  : ディレクトリパス                             */
    /* 戻り値: なし                                         */
    /********************************************************/
    public function registerDir($dir) {
        $this->_directories[] = $dir;
    }

    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: register                                     */
    /*======================================================*/
    /* 概要  : オートロードの対象のパスを登録する           */
    /* 引数  : なし                                         */
    /* 戻り値: なし                                         */
    /********************************************************/
    public function register() {
        spl_autoload_register(array($this, 'loadClass'));
    }

    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: loadClass                                    */
    /*======================================================*/
    /* 概要  : クラス名と一致するファイルの読み込み         */
    /* 引数  : クラス名                                     */
    /* 戻り値: なし                                         */
    /********************************************************/
    public function loadClass($class) {
        foreach ($this->_directories as $dir) {
            $file = $dir . '/' . $class . '.php';
            if (is_readable($file)) {
                require $file;
                return;
            }
        }
    }
}
