<?php
/********************************************************/
/* プログラム名：Request.php                            */
/*======================================================*/
/* 概要：リクエストURLから処理を振り分けるための処理    */
/*======================================================*/
/* 作成日：2016-9-5                                     */
/* 作成者：鶴田 博文                                    */
/* 最終更新日：                                         */
/* 更新者：                                             */
/********************************************************/
class Request
{
    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: isPost                                       */
    /*======================================================*/
    /* 概要  : リクエストがPOSTかどうか調べる               */
    /* 引数  : なし                                         */
    /* 戻り値: Boolean                                      */
    /********************************************************/
    public function isPost() {
        if ($_SERVER['REQUEST_METHOD'] === 'POST') {
            return true;
        }
        return false;
    }

    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: getGet                                       */
    /*======================================================*/
    /* 概要  : GETで送信された情報を取得                    */
    /* 引数  : name属性                                     */
    /* 戻り値: 取得した情報                                 */
    /********************************************************/
    public function getGet($name, $param = null){
        if (isset($_GET[$name])) {
            return $_GET[$name];
        }
        return $param;
    }

    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: getPost                                      */
    /*======================================================*/
    /* 概要  : POSTで送信された情報を取得                   */
    /* 引数  : name属性                                     */
    /* 戻り値: 取得した情報                                 */
    /********************************************************/
    public function getPost($name, $param = null){
        if (isset($_POST[$name])) {
            return $_POST[$name];
        }
        return $param;
    }

    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: getHostName                                  */
    /*======================================================*/
    /* 概要  : ホスト名を取得                               */
    /* 引数  : なし                                         */
    /* 戻り値: ホスト名                                     */
    /********************************************************/
    public function getHostName(){
        if (!empty($_SERVER['HTTP_HOST'])) {
            return $_SERVER['HTTP_HOST'];
        }
        return $_SERVER['SERVER_NAME'];
    }

    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: getRequestUri                                */
    /*======================================================*/
    /* 概要  : リクエストURL(ホスト部分より後ろの値)を取得  */
    /* 引数  : なし                                         */
    /* 戻り値: リクエストURL(ホスト部分より後ろの値)        */
    /********************************************************/
    public function getRequestUri(){
        return $_SERVER['REQUEST_URI'];
    }

    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: getBaseUrl                                   */
    /*======================================================*/
    /* 概要  : フロントコントローラーまでのパスを取得       */
    /* 引数  : なし                                         */
    /* 戻り値: フロントコントローラーまでのパス             */
    /********************************************************/
    public function getBaseUrl(){
        $scriptName = $_SERVER['SCRIPT_NAME'];
        $requestUri = $this->getRequestUri();

        if (0 === strpos($requestUri, $scriptName)) {
            return $scriptName;
        } else if (0 === strpos($requestUri, dirname($scriptName))
        ) {
            return rtrim(dirname($scriptName), '/');
        }
        return '';
    }

    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: getPath                                      */
    /*======================================================*/
    /* 概要  : フロントコントローラーのあとに続くパスを取得 */
    /* 引数  : なし                                         */
    /* 戻り値: フロントコントローラーのあとに続くパス       */
    /********************************************************/
    public function getPath() {
        $base_url = $this->getBaseUrl();
        $requestUri = $this->getRequestUri();

        //リクエストされたURLのホスト部分以降に「?」が含まれているか
        if (false !== ($sp = strpos($requestUri, '?'))) {
            $requestUri = substr($requestUri, 0, $sp);
        }

        $path = (string)substr($requestUri, strlen($base_url));
        return $path;
      }
}
