<?php
/********************************************************/
/* プログラム名：Response.php                           */
/*======================================================*/
/* 概要：レスポンス情報を送信する                       */
/*======================================================*/
/* 作成日：2016-9-5                                     */
/* 作成者：鶴田 博文                                    */
/* 最終更新日：                                         */
/* 更新者：                                             */
/********************************************************/
class Response
{
    protected $_content;  // コンテンツを保持するプロパティ
    protected $_statusCode = 200;  // ステータスメッセージを保持するプロパティ
    protected $_statusMsg = 'OK';  // ステータスコードを保持するプロパティ
    protected $_headers = array();  // レスポンスヘッダーのフィールドを保持するプロパティ
    const HTTP = 'HTTP/1.1 ';

    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: setContent                                   */
    /*======================================================*/
    /* 概要  : コンテンツをプロパティに格納するメソッド     */
    /* 引数  : コンテンツ                                   */
    /* 戻り値: なし                                         */
    /********************************************************/
    public function setContent($content) {
        $this->_content = $content;
    }

    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: setStatusCode                                */
    /*======================================================*/
    /* 概要  : ステータスコードとメッセージをプロパティに   */
    /*         格納するメソッド                             */
    /* 引数  : ステータスコードとメッセージ                 */
    /* 戻り値: なし                                         */
    /********************************************************/
    public function setStatusCode($code, $msg = '') {
        $this->_statusCode = $code;
        $this->_statusMsg = $msg;
    }

    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: setHeader                                    */
    /*======================================================*/
    /* 概要  : ヘッダーフィールドをプロパティに格納する     */
    /* 引数  : ヘッダー文字列                               */
    /* 戻り値: なし                                         */
    /********************************************************/
    public function setHeader($name, $value) {
        $this->_headers[$name] = $value;
    }

    /********************************************************/
    /* Public Function                                      */
    /*======================================================*/
    /* 関数名: send                                         */
    /*======================================================*/
    /* 概要  : レスポンスヘッダーとレスポンスボディを生成   */
    /* 引数  : なし                                         */
    /* 戻り値: なし                                         */
    /********************************************************/
    public function send(){
        header(self::HTTP . $this->_statusCode . ' ' . $this->_statusMsg);
        foreach ($this->_headers as $name => $value) {
            header($name . ': ' . $value);
        }
        print $this->_content;
    }
}
