<?php
/********************************************************/
/* プログラム名：index.php                              */
/*======================================================*/
/* 概要：フロントコントローラー                         */
/*       すべてのリクエストを受ける                     */
/*======================================================*/
/* 作成日：2016-9-5                                     */
/* 作成者：鶴田 博文                                    */
/* 最終更新日：                                         */
/* 更新者：                                             */
/********************************************************/

require '../bootstrap.php';
require '../PrefectureApplication.php';

$clsApp = new PrefectureApplication(true);
$clsApp->run();
